html/index.html
<!DOCTYPE html>
<html lang="tr">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ana Sayfa</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
<link rel="stylesheet" type="text/css" href="custom.css"/>
</head>
<body>
<div id="preamble" class="status">
<head>
<meta name="color-scheme" content="light dark">
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <style>
:root {
     color-scheme: light only;
}
::backdrop,:root {
    --sans-font: -apple-system,BlinkMacSystemFont,"Avenir Next",Avenir,"Nimbus Sans L",Roboto,"Noto Sans","Segoe UI",Arial,Helvetica,"Helvetica Neue",sans-serif;
    --mono-font: Consolas,Menlo,Monaco,"Andale Mono","Ubuntu Mono",monospace;
    --standard-border-radius: 5px;
    --bg: #fff;
    --accent-bg: #f5f7ff;
    --text: #212121;
    --text-light: #585858;
    --border: #898EA4;
    --accent:#3E3D40;
    --accent-text: var(--bg);
    --code: #c6a0f6;
    --preformatted: #444;
    --marked: #ffdd33;
    --disabled: #efefef
}

    img,video {
        opacity: .8;
        margin-top:1px;
    }
}
h2 > a {
position:absolute;
   }

.published > p, .published {
    margin-right: 1rem;
    position:relative;
    text-align:right;
    margin:-3rem 0rem 0rem 0rem;
    color:rgba(0,0,0,.4);
}


hr{
    border:none;
    height:0.5px;
    margin:auto;
   }
/* Adjustments for title and date styling */
   #preamble > header > nav > a {
     border:none;
     padding:0;
   text-decoration:none;
   margin:0 1rem 0 0;
   }
.outline-text-2 {
   text-align:justify;
   }
.icerik > p {
       margin: 1.5rem 0;
}
h2 > a {
    text-decoration:none;
   }
   a:hover{
       color:#212121;
   }
h2 {
    font-weight:300;
   }
   h2::first-line {
    font-weight:bold;
   }
   pre {
       font-size:.8rem;
   }
</style>
</head>
<body>
  <header>
    <h1 style="font-weight: bold;">Ömer Kurt</h1>
    <p style="color: #6a6a6a;">Özgür yazılım tutkunu, Emacsever</p>
    <nav>
      <a href="/">Ana Sayfa</a>
      <a href="/blog/">Blog</a>
      <a href="/hakkimda.html">Hakkımda</a>
      <a href="https://omerkurt.com.tr">ORUI</a>
      <a href="/blog/rss.xml">RSS</a>
    </nav>
  </header>
</body>
</div>
<div id="content" class="content">
<div id="outline-container-orgf0102dd" class="outline-2">
<h2 id="orgf0102dd">ORUI <br> Graph</h2>
<div class="outline-text-2" id="text-orgf0102dd">
<p>
Beynimde dönüp dolaşan notlarıma ORUI linkinden ulaşabilirsiniz. Bazı yazılarımı blog kategorisine sokmadığım için en mantıklı yerin ORUI olacağını düşündüm. Brave üzerinden girerken Shields özelliği soruna neden oluyor, Firefox ile girmenizi öneriyorum yada Sheilds özelliğini kapatabilirsiniz.
</p>
</div>
<div id="outline-container-org5d13d59" class="outline-3">
<h3 id="org5d13d59">Son <br> Yazılarım</h3>
<div class="outline-text-3" id="text-org5d13d59">
<ul class="org-ul">
<li><a href="blog/gpu.html">GPU Passthrough kurulumu</a></li>
<li><a href="blog/Neden-org-mode.html">Neden org-mode?</a></li>
</ul>
</div>
</div>

<div id="outline-container-org62bd2e3" class="outline-3">
<h3 id="org62bd2e3">Youtube <br> Videolar</h3>
<div class="outline-text-3" id="text-org62bd2e3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=UCEGDJJsFPs">GPU Passthrough</a></li>
<li><a href="https://www.youtube.com/watch?v=Di8ALt0KFb0">Neden org-mode?</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge528303" class="outline-2">
<h2 id="orge528303">Fikirler <br> Projeler</h2>
<div class="outline-text-2" id="text-orge528303">
<ul class="org-ul">
<li>Son zamanlarda whisper.cpp ile ilgileniyorum mpv media player üzerinden ister local ister streaming olarak subtitle oluşturma üzerine uğraşıyorum. Bununla alakalı video fikri var aklımda.</li>
<li>Elisp ve Lisp programlama dillerini öğrenmeye başladım. Mpv ile alakalı eklenti oluşturduktan sonra yazılarım bu diller hakkında olacak.</li>
<li>Orange pi 5 plus sipariş ettim bunla alakalı çok güzel planlarım var şimdilik. Yakında ORUI üzerinden paylaşacağım.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div clas="yorum">
<script src="https://giscus.app/client.js"
        data-repo="omerkurtdev/omerkurt.dev"
        data-repo-id="R_kgDOLH_-TA"
        data-category="General"
        data-category-id="DIC_kwDOLH_-TM4CcmCo"
        data-mapping="title"
        data-strict="0"
        data-reactions-enabled="1"
        data-emit-metadata="0"
        data-input-position="bottom"
        data-theme="light"
        data-lang="tr"
        crossorigin="anonymous"
        async>
</script>
</div>
<footer style="font-size:.8rem; color:#6f6f6f;">
<br>
<hr>
<p>Copyright © 2020-2024 Ömer Kurt<br>
İçeriklerim <a href="https://creativecommons.org/licenses/by-sa/4.0/deed.tr">CC-BY-SA 4.0</a> lisansı altındadır.
</p>
<p><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2 (<a href="https://orgmode.org">Org</a> mode 9.6.15) kullanılarak oluşturuldu.<a href="https://www.gnu.org/">GNU</a>/<a href="https://www.kernel.org/">Linux</a></p>
</footer>
</div>
</body>
</html>
